#+TITLE:       ABSOLUTELLY NO WARRANTY ARCHIVE
#+AUTHOR:      Osiris Alejandro Gómez
#+EMAIL:       osiux@osiux.com
#+LANGUAGE:    es
#+LINK_HOME:   index.html
#+INCLUDE:     header.org



** =ARCHIVE=

   #+BEGIN_SRC sh :session :results none :exports both
     cd ~/blog
     ls *.org | egrep -o "^[0-9]{4}" | sort -u | while read i
     do
        echo "- [[file:$i.org][$i]]"
     done >years.org
   #+END_SRC

   #+INCLUDE: "years.org"

** =STATS=

*** =YEARS=

    #+BEGIN_SRC sh :session :results output :exports both
      cd ~/blog && ls *.org | egrep -o "^[0-9]{4}-" | tr -d - | sort | uniq -c | barra
    #+END_SRC

    #+RESULTS:
    #+begin_example
     13.10 %  13.10 %         11 ███                  2011
     41.67 %  28.57 %         24 ███████              2012
     60.71 %  19.05 %         16 ████                 2013
     73.81 %  13.10 %         11 ███                  2014
     76.19 %   2.38 %          2 ▌                    2015
     77.38 %   1.19 %          1 ▌                    2016
     94.05 %  16.67 %         14 ████                 2017
     98.81 %   4.76 %          4 █                    2018
    100.00 %   1.19 %          1 ▌                    2019
            84
    #+end_example

*** =MONTHS=

    #+BEGIN_SRC sh :session :results output :exports both
      cd ~/blog && ls *.org | egrep -o "^[0-9]{4}-[0-9]{2}" | cut -c 6- | sort | uniq -c | barra
    #+END_SRC

    #+RESULTS:
    #+begin_example
      3.57 %   3.57 %          3 █                    01
     10.71 %   7.14 %          6 █                    02
     20.24 %   9.52 %          8 ██                   03
     45.24 %  25.00 %         21 ██████               04
     55.95 %  10.71 %          9 ██                   05
     66.67 %  10.71 %          9 ██                   06
     75.00 %   8.33 %          7 ██                   07
     80.95 %   5.95 %          5 █                    08
     86.90 %   5.95 %          5 █                    09
     90.48 %   3.57 %          3 █                    10
     96.43 %   5.95 %          5 █                    11
    100.00 %   3.57 %          3 █                    12
            84
    #+end_example

